{
  "users": [
    {
      "login": "user",
      "password": "qwerty123"
    }
  ],
  "courses": [
    {
      "id": "1",
      "title": "InnerSource",
      "creationDate": "2012-04-23T00:00:00.000Z",
      "duration": 23,
      "description": "InnerSource is the application of open source methodologies to internally-developed software. While simple to define, InnerSource can be difficult to explain and implement successfully. Many engineers lack background in open source and the ideas and mechanics of open code development. Even those with that background face a new set of constraints and motivations when trying to work openly within the enterprise. This learning path gives a simple, easy to understand introduction to InnerSource. It introduces key terms, concepts, and principles for effective InnerSource along with explanations and real examples. It is intended to bring newcomers up to speed as well as provide those with experience a common vocabulary to use when discussing more advanced concepts.",
      "authors": [
        "Ernst Handel",
        "Chop-suey Chinese",
        "Maison Dewey"
      ]
    },
    {
      "id": "2",
      "title": "Red Hat RHCSA 8",
      "creationDate": "2000-10-21T00:00:00.000Z",
      "duration": 105,
      "description": "The Red Hat Certified System Administrator (RHCSA) Complete Video Course, 3rd edition is all new and fully updated for RHEL 8. This course is designed to teach you everything you need to know to pass the RHCSA exam. Every objective in the exam is discussed, along with in-depth lessons on complex topics, so they are not confusing. Each lesson ends with a lab, so you can dive into your own projects and see Red Hat in action; many of these labs mimic scenarios you might find on the exam, so you get the experience you need to practice for the exam. These labs also include video solutions, so you can also see in real-time how to work through the problems and figure out the best methods for working through each scenario",
      "authors": [
        "Alfreds Futterkiste"
      ]
    },
    {
      "id": "3",
      "title": "Introduction to Blockchain Technology",
      "creationDate": "1976-01-04T00:00:00.000Z",
      "duration": 60,
      "description": "Blockchain technology is among the most exciting developments in the IT industry in many years. Often shrouded in mystery (including who the person is who developed it), today blockchain is most well known as the technology that underpins cryptocurrencies, the most famous of those being Bitcoin. But blockchain’s distributed-ledger technology holds the promise to revolutionize the way businesses and governments create and maintain important records of transactions of all kinds, whether it’s contracts, deeds, or any other types of activity for which an inviolable record must be maintained.",
      "authors": [
        "Maison Dewey",
        "Ernst Handel",
        "Rancho Grande"
      ]
    }
  ],
  "authors": []
}